/**
 Здесь размещаются комментарии к пакету.
 <p>Для формирования комментариев к пакетам следует добавить отдельный файл <strong>( package-info.java или package.html)</strong> в каталог каждого пакета.</p>

 Есть 2 варианта:
 <p> - применить HTML-файл под именем package.html. Весь текст заключенный между тегами "body" извлекается утилитой javadoc</p>
 <p> - подготовить файл под именем package-info.java. Он должен содержать начальный комментарий Javadoc, за которым следует оператор
 package и больше никакого кода и коментариев.</p>
 <p> - все исходники можно снабдить обзорными камментами в overview.html расположенном в родительском каталоге со всеми исходными файлами.</p>

 <p>Комментарии к классам, методам и переменнымразмещаются в исходных файлах.</p>
 */
package org.billing.jlab.javacore.javadoc;