/**
 Комментарии к классам, методам и переменным размещаются в исходных файлах, но для формировани комментариев к пакетам
 следует добавить отдельный файл в каталог каждого пакета. Есть 2 варианта:
 - применить HTML-файл под именем package.html. Весь текст между <body> .... </body> извлекается утилитой javadoc
 - подготовить файл под именем package-info.java. Он должен содержать начальный комментарий Javadoc, за которым следует оператор
 package и больше никакого кода и коментариев.
 */
package org.billing.jlab.javadoc;